{"sections":{"main":{"type":"dbtfy-faq-section","blocks":{"dac5b4fd-5efb-41d4-94d0-3a2744a13a00":{"type":"category_block","settings":{"title":"General CBD FAQ's","dbtfy_faq_category":"General CBD FAQ's","dbtfy_faq_icons":"contact_support"}},"68b866b8-ff1c-45d8-8aec-9eccc5792521":{"type":"text_block","settings":{"title":"","dbtfy_faq_page_open_1":false,"dbtfy_faq_page_icon_1":"","question_1":"What Is CBD?","text_1":"<p>HEMP and CANNABIS both come from the same plant Cannabis Sativa L. <br\/>Before we get into what CBD is, it’s important for you to understand the plant we are talking about. Specifically, what we call HEMP and what we call CANNABIS. <\/p><p>It’s important to note that the CBD molecule from Hemp is the same as the CBD molecule from Cannabis. Many still confuse the fact that these plants are sisters. Hemp contains very low amounts of THC. Many CBD studies have shown an array of medical benefits. <\/p><p>The reason CBD and other hemp-derived compounds works well for so many conditions, is the endocannabinoid system, a central component of the health and healing of every human and almost every animal. The Endocannabinoid system is a central regulatory system that affects a wide range of biological processes like our immune system, nervous system, and all of the body’s organs. CBD helps bring your entire body back into balance, not just one single area like most supplements. <br\/><br\/><a href=\"https:\/\/www.solcbd.com\/pages\/what-is-cbd\" title=\"What is CBD?\">Click here to learn more<\/a><\/p>","dbtfy_faq_page_open_2":false,"dbtfy_faq_page_icon_2":"","question_2":"How Does CBD Work?","text_2":"<p>CBD works as the switch that turns on the regulatory system in the body called the endocannabinoid system. <\/p><p>Did you know that your body produces its own cannabinoids similar to CBD and THC? These endogenous cannabinoids are a part of a system that acts as the “master control” of the body. <\/p><p>That same system is designed to work with CBD! The endogenous cannabinoid system, or endocannabinoid system (ECS), is a recently discovered system of naturally occurring cannabinoids and cannabinoid receptor sites throughout your entire body! <\/p><p>This system in the brain is made up of endocannabinoids and their receptor sites. Endocannabinoids are naturally occurring substances in the brain that activate the same receptor sites as cannabinoids from cannabis. Research has proven the endocannabinoid system is involved in a number of physiological processes that can include appetite, pain, mood, and memory. <br\/><a href=\"https:\/\/www.solcbd.com\/pages\/how-does-cbd-work\" title=\"How Does CBD Work?\"><br\/>Click here to learn more<\/a><\/p>","dbtfy_faq_page_open_3":false,"dbtfy_faq_page_icon_3":"","question_3":"Can I Get High Off Of CBD?","text_3":"<p>The good news is no, you do not get high with CBD. <\/p><p>THC has a different effect than CBD on your body because CBD is not psychoactive. So, you will not experience an altered state from CBD, as you would from THC.<\/p>","dbtfy_faq_page_open_4":false,"dbtfy_faq_page_icon_4":"","question_4":"Will CBD Show Up on My Drug Test? Does Your Oil Contain THC?","text_4":"<p>Our products contain below 0.3% tetrahydrocannabinol (THC) so should no cause a failed drug test as it is below the legal limit. However, it is important to check with your employer about their requirements for THC limits.<\/p><p>In addition, CBD does not show up positive on standard drug tests for marijuana. <br\/><br\/>Our CBD is thoroughly tested to make sure our levels are accurate and in accordance with FDA regulations.<\/p><p><\/p>","dbtfy_faq_page_open_5":false,"dbtfy_faq_page_icon_5":"","question_5":"Is CBD Addictive?","text_5":"<p>CBD, or cannabidiol, is generally not considered to be addictive, according to current scientific understanding. The World Health Organization (WHO) has stated that \"CBD exhibits no effects indicative of any abuse or dependence potential.\" Additionally, unlike THC, the psychoactive component found in cannabis, CBD doesn't produce the \"high\" that is often associated with cannabis use.<\/p><p>It's worth mentioning that CBD is being studied for its potential to treat certain kinds of addiction, such as opioid or nicotine addiction, although more research is needed to substantively support these claims.<\/p><p>Remember that individual experiences with CBD can vary, and it's crucial to consult a healthcare provider for personalized medical advice. While I strive to provide accurate information, this shouldn't replace professional guidance.<\/p>","dbtfy_faq_page_open_6":false,"dbtfy_faq_page_icon_6":"","question_6":"Does CBD Cause An Increase In Appetite?","text_6":"<p>THC is typically known to have a profound increase in appetite, but CBD helps regulate your digestive system. <\/p><p>Some people, however, might experience a slight increase in appetite but that is due to a metabolism improvement.<\/p>","dbtfy_faq_page_open_7":false,"dbtfy_faq_page_icon_7":"","question_7":"Can CBD Help My.....?","text_7":"<p><strong>Can CBD benefit me if I have Inflammatory Bowel Disease (IBS)?<\/strong><br\/><br\/>There are a number of articles and studies that strongly support the role that Cannabidiol (CBD) plays in the treatment of IBS and even colon cancer. <\/p><p>CBD is growing strong momentum in the scientific community as a low cost, non-toxic alternative to common drug therapies for IBS and other chronic illnesses. It is of particular interest to researchers due to its non-psychoactive and federally legal status, two attributes which THC does not have. <\/p><p><a href=\"https:\/\/www.solcbd.com\/blogs\/news\/53640197-cbd-and-its-benefits-for-inflammatory-bowel-disease\/\">Here's a link to an article you might find helpful<strong><br\/><br\/><\/strong><\/a><strong>What are the CBD Oil Benefits to Childhood Epilepsy?<br\/><br\/><\/strong>There are a number of articles and studies that strongly support the role that Cannabidiol (CBD) plays in the treatment of epilepsy and seizures.<br\/><br\/>CBD is growing strong momentum in the scientific community as a low cost, non-toxic alternative to common drug therapies due to its non-psychoactive and federally legal status, two attributes which THC does not have.<br\/><br\/><a href=\"http:\/\/www.thecannabisadvisory.com\/category\/clinical-studies\/health_condition\/epilepsy\/\" target=\"_blank\">Learn more about recent studies on this topic by clicking here<br\/><br\/><\/a><strong>Can CBD help treat or prevent Parkinson's disease?<br\/><br\/><\/strong>Recent developments in CBD research states that there is a growing body of evidence through small non-human trials that shows CBD in conjunction with THC that may slow the progress of Parkinson's disease. <\/p><p>As there have been no developments of this nature to date, the future is looking very bright for both the treatment of Parkinson's symptoms with CBD and potentially the treatment of the disease itself. <\/p><p><a href=\"https:\/\/www.solcbd.com\/blogs\/news\/118483525-muhammad-ali-parkinson-s-and-the-promise-of-cbd\">Visit our blog article on Parkinson's and CBD to learn more<\/a>.<br\/><br\/><strong>Which product is best for cancer?<br\/><br\/><\/strong>Firstly, we can not make any claims about our product and cancer or any disease. <\/p><p>That being said, studies have shown amazing effects with CBD. We strongly advise working with a professional that intimately understands your unique situation, your biology, lifestyle, genetics, and of course CBD. <\/p><p>That will allow them to direct you to the best course of action. What I can say is that our product supports an important biological system in your body. That system when fully active has shown to activate the body's ability to do what it does best, heal itself.<br\/><br\/><strong>What are some diseases that CBD can help cure? I have a condition and was wondering if it will help me?<\/strong><\/p><p>Due to FDA regulations, we cannot state any claims regarding our products ability to help with specific ailments or diseases, as our products are considered a nutritional supplement or food. <\/p><p>However, CBD is a powerful nutrient that helps the body do what it does best - heal itself. Our products help the body regain balance, and when the body has the tools it needs for balance, amazing things happen.<\/p><p>There are numerous studies on many conditions, and if you want to learn more, you can search <a href=\"https:\/\/scholar.google.com\/\" target=\"_blank\">scholar.google.com<\/a> for studies by typing CBD or Cannabidiol plus your condition. <\/p><p><a href=\"https:\/\/www.solcbd.com\/pages\/will-cbd-help-me\" title=\"Will CBD Help Me?\">To learn more on how CBD will help you, please click here for more information.<\/a><\/p>","dbtfy_faq_page_open_8":false,"dbtfy_faq_page_icon_8":"","question_8":"How Is Topical CBD Absorbed?","text_8":"<p>Some people have asked how is it possible for a topical to help with conditions like joint pain, inflammation, and muscle aches, surely it needs to be ingested to absorb into the bloodstream?<br\/><br\/>This could not be further from the truth. In fact, topical CBD is a faster way of getting the cannabinoid to the CB receptor sites.<br\/><br\/>These CB receptor sites sit in the dermis, the second layer of the skin, where CBD is delivered pretty fast after application.<\/p><p>The only downside of using CBD balm and other topicals is that it must be applied liberally to take effect. The skin generally has low permeability to substances, and a larger volume of balm must be applied for CBD to pass this barrier. All you need to do is apply the balm to clean, dry skin, and massage into affected areas as often as needed.<\/p><p>The amount used depends greatly on how you react to it, some people use it as little as once per day and feel relief, so play around with the dose until you find what works for you.<\/p>","dbtfy_faq_page_open_9":false,"dbtfy_faq_page_icon_9":"","question_9":"What Percentage Of CBD Is In SOL CBD?","text_9":"<p>We've noticed quite a few questions about percentage of CBD in our product.<\/p><p>People in our industry are showing off their CBD percentages in attempt to make their product look more appealing. <\/p><p>BUT here's what you must understand:<\/p><p>Percentages of CBD are important only in the formulation process so that you know how much CBD is going into each bottle. This can come in oil form or isolate form (this is where all other important compounds are stripped and what remains is just CBD).<\/p><p>We'll explain why isolates are not as effective as full spectrum CBD in a moment.<\/p><p>Otherwise, percentage is <span style=\"text-decoration:underline\"><strong>irrelevant.<\/strong><\/span><\/p><p>What you as a customer need to pay attention to is the actual profile of the oil.<\/p><p>In other words: <strong>It's quality over quantity!<\/strong><\/p><p>For example, a 10% CBD oil that has been CO2 extracted and processed without heat so it maintains a full cannabinoid and terpene profile (like ours) is better than a 50% oil cheaply extracted with butane and heated excessively so it has no more terpenes left. <\/p><p>Also, a lot of competitor products are made with isolate, which is 99%. Very high %, but it is an isolate so it's missing the rest of the \"whole plant\" compounds and therefore, likely to be limited in effects.<\/p><p><strong>Cannabinoids and Terpenes work together in a process called the \"entourage effect\". <\/strong>In simple terms, the entourage effect is the synergy between the compounds to work more powerfully and effectively in the body. <\/p><p>Most companies that talk about percentages are being deceptive or are just clueless.<\/p><p>Now you understand that the use of percentages is likely a marketing gimmick.  <\/p><p>Always look for how much CBD is contained per bottle and per serving. If someone is pushing percentage, it's a clear sign to avoid that product.<\/p><p><strong>Here's what really counts:<\/strong><\/p><p>SOL CBD oil is CO2 extracted and carefully processed to maintain all the key medicinal components of the hemp plant. Organic, non-GMO and no heating. Same rules apply to our other ingredients in our products. <br\/><br\/><strong>Bottom Line:<\/strong><br\/>We deliver the highest quality ingredients, manufactured with utmost care to bring you an oil that synergistically delivers what your body needs.<\/p>","dbtfy_faq_page_open_10":false,"dbtfy_faq_page_icon_10":"","question_10":"What's The Difference Between Hemp & Cannabis?","text_10":"<p><strong>HEMP and CANNABIS both come from the same plant Cannabis Sativa L.<\/strong><br\/>Hemp and Cannabis or Marijuana are common names of two plants with a confused history. Many people, even with access to a wealth of information, confuse them and think they are vastly different (they are not). This misunderstanding allows people in power to manipulate public perception, laws and regulations. Please take the time to <br\/>thoroughly understand the difference. We curated the information below to help you understand.<\/p><p><strong>The only difference between them is their use:<\/strong><br\/>The term ‘hemp’ commonly refers to the industrial\/commercial use of the cannabis stalk and seed for textiles, foods, papers, body care products, detergents, plastics and building materials.<\/p><p>The term ‘marijuana’ or ‘cannabis’ refers to the medicinal, recreational or spiritual use involving the smoking of cannabis flowers. Industrial hemp contains only about 0.3% – 1.5% THC (Tetrahydrocannabinoids, the intoxicating ingredients that make you high) while marijuana contains about 5% – 10% or more THC.<\/p><p>Hemp fiber is the longest, strongest and most durable of all natural fibers. Also, hemp cultivation requires no chemicals, pesticides or herbicides.<\/p><p>Grown in rotation with other crops such as corn and legumes, hemp farming is completely sustainable. Hemp produces four times as much fibre per acre as pine trees. Hemp tree-free paper can be recycled up to seven times, compared with three times for pine-pulp based papers. Hemp is easy to grow, and actually conditions soil where it grows. The seed and seed-oil are high in protein, essential fatty and amino acids, and vitamins. Hemp would be an ideal source of biomass for fuel, and hemp Ethanol burns very cleanly.<\/p><p>Hemp and humanity have been linked for over 10,000 years. Hemp was our first agricultural crop, and remained the planet’s largest crop and most important industry until late last century. Most of the non-Western world never stopped growing hemp, and today hemp for commercial use is grown mostly by China, Hungary, England, Canada, Australia, France, Italy, Spain, Holland, Germany, Poland, Romania, Russia, Ukraine, India and throughout Asia.<\/p><p><strong>Differences Between Industrial Hemp and Marijuana<\/strong><\/p><p>Industrial hemp is a variety of cannabis sativa that has a long history of use in the United States.<\/p><p>However, since the 1950s it has been lumped into the same category of marijuana, and thus the extremely versatile crop was doomed in the United States. As mentioned above industrial hemp is technically from the same species of plant that psychoactive marijuana comes from. However, it is from a different variety, or subspecies that contains many important differences. The main differences between industrial hemp and marijuana will be discussed below.<\/p><p>Industrial hemp has low THC levels compared to marijuana specifically cultivated for personal psychoactive use. Whereas marijuana that can be smoked usually contains between five and ten percent THC, industrial hemp contains about one-tenth of that. In order to get a psychoactive effect, one would need to smoke ten or twelve hemp cigarettes over a very short period of time.<\/p><p>The reason for the low THC content in hemp is that most THC is formed in resin glands on the buds and flowers of the female cannabis plant. Industrial hemp is not cultivated to produce buds, and therefore lacks the primary component that forms the marijuana high. Furthermore, industrial hemp has higher concentrations of a chemical called Cannabidiol (CBD) that has a negative effect on THC and lessens its psychoactive effects when smoked in conjunction.<\/p><p>Compared to cannabis sativa indica, cannabis sativa sativa (industrial hemp variety) has a much stronger fiber. This fiber can be used in anything from rope and blankets to paper. Marijuana fiber has a low tensile strength and will break or shred easily, making it a poor fibrous plant when compared to industrial hemp.<\/p><p>Industrial hemp also grows differently than THC-containing cannabis. Hemp is typically grown up, not out, because the focus is not on producing buds but on producing length of stalk. In this way, hemp is a very similar crop to bamboo. The stalk contains the fiber and hard, woody core material that can be used for a variety of purposes, even carpentry. Generally, THC-producing marijuana plants are grown to an average of five feet in height. Industrial hemp on the other hand is grown to a height of ten to fifteen feet before harvest. Also, it is fairly difficult to grow concealed marijuana within industrial hemp crops as the DEA alleges. Since industrial hemp is grown so close together and is generally a very narrow, vertical growth crop, any THC-producing marijuana would stick out like a sore thumb. Its wide growth would require a large amount of space to itself in order to get adequate sunlight from beyond the tops of the competing industrial hemp plants.<\/p><p>The two also differ in the areas that they can be effectively grown. THC-producing Marijuana must be grown in generally warm and humid environments in order to produce the desired quantity and quality of THC-containing buds. However, since industrial hemp does not contain these buds, and the hardy parts of the plant are the more desired, it can be grown in a wider range of areas. Generally, industrial hemp grows best on fields that provide high yields for corn crops, which includes most of the Southwest, Southeast, and Northeast United States. Furthermore, since industrial hemp can use male plants as well as female plants (since the object is not THC production), higher crop yields can result.<\/p><p>Hemp also has little potential to produce high-content THC when pollinated. As long as industrial hemp plants are pollinated by members of their own crop, then the genetics will remain similar with low levels of THC.<\/p><p>One would have to place several marijuana plants in close vicinity in over several generations order to alter the genetics substantially of the offspring.<\/p><p>Since there are so many differences between industrial hemp and high-THC marijuana, it seems to make sense that it would be a fostered, rather than demonized crop. Although technically hemp is not illegal to grow, it requires obtaining a special permit from the DEA. These permits are rarely given out and require that the crop be surrounded by security measures such as fences, razor wire, security guards, or dogs. For a crop that has little-to-no potential to get people high, the current attitude is both irresponsible and draconian.<\/p><p>Industrial hemp could transform the economy of the United States in a positive and beneficial way, and therefore should be exploited to its full potential.<\/p>"}},"b461e85b-6a51-4009-9120-c6b165347631":{"type":"text_block","settings":{"title":"","dbtfy_faq_page_open_1":false,"dbtfy_faq_page_icon_1":"","question_1":"Hemp CBD vs Marijuana CBD","text_1":"<p>There is a lot of talk about the effectiveness of CBD coming from hemp vs cannabis.<\/p><p>Let's unpack this and explore the facts.<\/p><p>First, I must say that while we sell hemp derived CBD, we fully understand the power of THC and its effectiveness for certain conditions.<\/p><p>Secondly, if you haven't done so already, please read about the plant itself in our post: <a href=\"https:\/\/www.solcbd.com\/pages\/whats-the-difference-between-hemp-cannabis\" target=\"_blank\">What's The Difference Between Hemp & Cannabis<\/a><\/p><p>The bottom line here is we're talking about Cannabis Sativa L. when referring to \"Hemp\" or \"Marijuana\".<\/p><p>Think of a tomato plant.<\/p><p>Now imagine the tomato growing on it.<\/p><p>You may have imagined a large heirloom tomato or maybe a small cherry tomato.<\/p><p>Both of those tomatoes contain pretty much the same nutrients. Of course, there will be some variation and breeders can choose to express one trait over another.<\/p><p>No different from Cannabis Sativa L. <\/p><p>I'm going to get a little geeky here but stick with me...<\/p><p>It comes down to the \"chemovar\" or \"chemotype\" of the Cannabis Sativa L. It's essentially the type or variety of the plant. Here's the definition:<\/p><p><em>A chemotype (sometimes called <\/em><em><strong>chemovar<\/strong><\/em><em>) is a chemically distinct entity in a plant or microorganism, with differences in the composition of the secondary metabolites. Minor genetic and epigenetic changes with little or no effect on morphology or anatomy may produce large changes in the chemical phenotype.<\/em><\/p><p>Simply put, a chemotype is derived from a plant that has the same<strong> <\/strong>appearance and characteristics but has chemical differences.<\/p><p>Chemotype differs throughout the world and between what has come to be falsely differentiated as \"marijuana\" and \"hemp\".<\/p><p>Again, it is the same plant and the only major true difference is the THC content of the plant.<\/p><p>All other cannabinoids and terpenes etc. will differ between the chemotype of both categories.<\/p><p>There are many marijuana chemovars that have THC as the highest component. Alternatively, it could be seen as the same as some hemp chemovars that have CBD as the highest component. <\/p><p>Domestic \"hemp\" is marijuana that was bred to be higher in CBD and lower than 0.3% THC so therefore now is by definition \"Hemp\".<\/p><p><strong>All else stays the same in the plant.<\/strong><\/p><p>That being said, the \"entourage effect\" is in effect in both plants. The \"entourage effect\" is the role that other molecules in cannabis have in conjunction with the main cannabinoids (CBD\/THC). <\/p><p><strong>Worth Repeating:<\/strong> THC is important and in some conditions is required.<\/p><p>The takeaway here is that both plants have the beneficial terpenes and cannabinoids, the difference being levels of THC and CBD.  <\/p><p>The Critical Importance Of Growth & Extraction <\/p><p>Another extremely important thing to keep in mind here is how the plant is grown, the conditions, and the extraction methods.<\/p><p>Hemp pulls environmental toxins and must be grown in pristine conditions without the use of pesticides and other chemicals. SOL✿CBD is grown in Northern Europe where the air is clean and the soil is mineral rich. No chemicals are used - ever!<\/p><p>Extraction should be one that maintains plant integrity. Some chemical extraction methods like butane or pentane strip the plant of vital nutrients. CO2 extraction is the best method and the one we use. It's more expensive but we feel the cost of stripping nutrients is higher - many other manufacturers do not. <\/p><p>The Bottom Line<\/p><p>The overall view that CBD coming from cannabis is superior is not supported by any data and represents a typical ignorant view perpetuated by the THC industry.<\/p>","dbtfy_faq_page_open_2":false,"dbtfy_faq_page_icon_2":"","question_2":"Can Your Products Be Mixed With Oil And Used Externally?","text_2":"<p>Yes, Infact some of our products already contain coconut oil and can be used topically. Check the product labels for details  <\/p>","dbtfy_faq_page_open_3":false,"dbtfy_faq_page_icon_3":"","question_3":"","text_3":"","dbtfy_faq_page_open_4":false,"dbtfy_faq_page_icon_4":"","question_4":"","text_4":"","dbtfy_faq_page_open_5":false,"dbtfy_faq_page_icon_5":"","question_5":"","text_5":"","dbtfy_faq_page_open_6":false,"dbtfy_faq_page_icon_6":"","question_6":"","text_6":"","dbtfy_faq_page_open_7":false,"dbtfy_faq_page_icon_7":"","question_7":"","text_7":"","dbtfy_faq_page_open_8":false,"dbtfy_faq_page_icon_8":"","question_8":"","text_8":"","dbtfy_faq_page_open_9":false,"dbtfy_faq_page_icon_9":"","question_9":"","text_9":"","dbtfy_faq_page_open_10":false,"dbtfy_faq_page_icon_10":"","question_10":"","text_10":""}},"400c8ab9-7e9b-45d8-a27c-364d2a298b6a":{"type":"category_block","settings":{"title":"Shipping","dbtfy_faq_category":"Shipping","dbtfy_faq_icons":"contact_support"}},"ad11313e-7fb3-441b-99e0-d7f72da93f4f":{"type":"text_block","settings":{"title":"","dbtfy_faq_page_open_1":false,"dbtfy_faq_page_icon_1":"","question_1":"What Is The Shipping Cost?","text_1":"<p>For all orders over $85, shipping is free.<br\/><br\/>If your order is less than $85, you will be charged $6.95 for shipping.<br\/><br\/><a href=\"https:\/\/www.solcbd.com\/policies\/shipping-policy\" title=\"Shipping Policy\">View our full shipping policy<\/a><\/p>","dbtfy_faq_page_open_2":false,"dbtfy_faq_page_icon_2":"","question_2":"Where Do You Ship The Products From?","text_2":"<p>Our fulfilment center is in Michigan, so all orders are shipped from there.<\/p>","dbtfy_faq_page_open_3":false,"dbtfy_faq_page_icon_3":"","question_3":"How Long Does The Shipping Take?","text_3":"<p>Every product in stock is shipped within 48 hours. It is also noted in the Shopping Cart and informs you if a product is out of stock. <\/p><p>Sometimes our fulfillment system triggers \"unverified address\" error and the order will be automatically paused until we get in touch with you to verify details.  <br\/><br\/>We do our best to ship items out as quickly as possible, so we often get orders out more quickly.<\/p><p>The method of delivery – our shipping method is USPS Priority. We count on them to deliver things as quick as possible and that usually means 2-7 business days depending on your location.<\/p><p>Additionally, please note that delivery time is also based on “business” days. For example, if you place an order on Saturday, it’s impossible for us to ship an item on the same day as all the shippers are closed.<\/p><p><a href=\"https:\/\/www.solcbd.com\/policies\/shipping-policy\" title=\"Shipping Policy\">View our full shipping policy<\/a><\/p>","dbtfy_faq_page_open_4":false,"dbtfy_faq_page_icon_4":"","question_4":"What Are The Shipping Methods You Use?","text_4":"<p>Our primary shipping service is USPS first class mail, but you can upgrade to any shipping method or carrier by <a href=\"https:\/\/www.solcbd.com\/pages\/contact\" title=\"Contact Us\">contacting customer service<\/a> before placing your order.<\/p><p><a href=\"https:\/\/www.solcbd.com\/policies\/shipping-policy\" title=\"Shipping Policy\">View our full shipping policy<\/a><\/p>","dbtfy_faq_page_open_5":false,"dbtfy_faq_page_icon_5":"","question_5":"Do You Have Expedited Shipping Options?","text_5":"<p>You can call us on <a href=\"tel:800-413-5420\" target=\"_blank\">800 413 5420<\/a> to upgrade shipping to any carrier.<\/p>","dbtfy_faq_page_open_6":false,"dbtfy_faq_page_icon_6":"","question_6":"","text_6":"","dbtfy_faq_page_open_7":false,"dbtfy_faq_page_icon_7":"","question_7":"","text_7":"","dbtfy_faq_page_open_8":false,"dbtfy_faq_page_icon_8":"","question_8":"","text_8":"","dbtfy_faq_page_open_9":false,"dbtfy_faq_page_icon_9":"","question_9":"","text_9":"","dbtfy_faq_page_open_10":false,"dbtfy_faq_page_icon_10":"","question_10":"","text_10":""}},"792bcd7d-3fab-473a-8359-9273551120a8":{"type":"category_block","settings":{"title":"Side Effects & Drug Interactions","dbtfy_faq_category":"Side Effects & Drug Interactions","dbtfy_faq_icons":"contact_support"}},"93ec3a6b-e20f-4654-ad18-a1f64ab903a3":{"type":"text_block","settings":{"title":"","dbtfy_faq_page_open_1":false,"dbtfy_faq_page_icon_1":"","question_1":"I'm Not Feeling Anything After Taking CBD","text_1":"<p>CBD is a nutrient. <\/p><p>For some, this nutrient will move the needle dramatically and immediately. For many, it will take time, and for others, it will be subtle. What's important to understand, is that many factors come into play when introducing any compound into your body: Genetics, Overall Lifestyle, Emotions (stress levels), Dietary Habits & Nutritional Deficiencies, Physical Habits, Environmental Stressors, Sleep Health...etc. <\/p><p>All those things play a role in optimal health. CBD, plus all other incredible components in the Hemp plant, are available to ASSIST in the PROCESS of achieving optimal health. We all naturally look for a panacea, a magic pill to quickly fix us. The reality is that there is no magic pill or potion. We must be patient, become the guru of our own biology and decide to take full responsibility for our given condition by moving lovingly to resolution - no matter what. <\/p>","dbtfy_faq_page_open_2":false,"dbtfy_faq_page_icon_2":"","question_2":"Are There Drug Interactions I Should Know About?","text_2":"<p>CBD is exceptionally safe, but if you do take blood thinners, opiates, and\/or anti-epileptic medication, there's a chance of an adverse effect if you take a high dose of CBD (over 30mg per day). <\/p><p>CBD potentiates prescription pain meds, so if you use the medication mentioned above, you would only need 1\/2 of your regular dose to feel the same results if you take CBD too. <\/p><p>We highly recommend consulting with your physician first. <\/p><p><a href=\"https:\/\/www.solcbd.com\/pages\/pharmaceutical-drug-interaction-with-cbd\" title=\"https:\/\/www.solcbd.com\/pages\/pharmaceutical-drug-interaction-with-cbd\"><strong>We put together an article about interactions so click here to learn more. <\/strong><\/a><\/p>","dbtfy_faq_page_open_3":false,"dbtfy_faq_page_icon_3":"","question_3":"Is It Normal To Feel Dizzy When You First Start Taking?","text_3":"<p>We use MCT oil which is derived from organic coconut oil in some of our tinctures, and I have heard that coconut oil (if it's a new addition to the diet) can make some people feel dizzy, but it goes away within a week usually. <\/p><p>Try taking the tincture with food rather than on an empty stomach for the first week or two.<\/p>","dbtfy_faq_page_open_4":false,"dbtfy_faq_page_icon_4":"","question_4":"Is It Normal To Feel Tired After Starting The Products?","text_4":"<p>Yes, you may feel tired as the plant works on balancing your body. <\/p><p>Listen to your body and modulate your dosage accordingly.<\/p>","dbtfy_faq_page_open_5":false,"dbtfy_faq_page_icon_5":"","question_5":"","text_5":"","dbtfy_faq_page_open_6":false,"dbtfy_faq_page_icon_6":"","question_6":"","text_6":"","dbtfy_faq_page_open_7":false,"dbtfy_faq_page_icon_7":"","question_7":"","text_7":"","dbtfy_faq_page_open_8":false,"dbtfy_faq_page_icon_8":"","question_8":"","text_8":"","dbtfy_faq_page_open_9":false,"dbtfy_faq_page_icon_9":"","question_9":"","text_9":"","dbtfy_faq_page_open_10":false,"dbtfy_faq_page_icon_10":"","question_10":"","text_10":""}}},"block_order":["dac5b4fd-5efb-41d4-94d0-3a2744a13a00","68b866b8-ff1c-45d8-8aec-9eccc5792521","b461e85b-6a51-4009-9120-c6b165347631","400c8ab9-7e9b-45d8-a27c-364d2a298b6a","ad11313e-7fb3-441b-99e0-d7f72da93f4f","792bcd7d-3fab-473a-8359-9273551120a8","93ec3a6b-e20f-4654-ad18-a1f64ab903a3"],"settings":{"show_on_desktop":true,"show_on_mobile":true,"title":"","subtitle":"Here are some of our frequently asked questions.","section_style":"section-blank","dbtfy_faq_searchbox":true,"dbtfy_faq_search_placeholder":"Search questions...","text_alignment":"text-left","text_alignment_mobile":"text-center","dbtfy_faq_bannerbox":true,"dbtfy_faq_banner_icon":"live_help","dbtfy_faq_banner_text":"Didn't find your answer?","dbtfy_faq_banner_subtitle":"Our customer service will be happy to help you.","dbtfy_faq_btn":"Get in Touch","dbtfy_faq_link":"https:\/\/www.solcbd.com\/pages\/contact"}},"adb4e673-02fd-41cc-a905-b5725680ce40":{"type":"custom-html","blocks":{"template--19811370795287__adb4e673-02fd-41cc-a905-b5725680ce40-html-1":{"type":"html","settings":{"title":"FAQ SCHEMA","code":"<script type=\"application\/ld+json\">\n{\n  \"@context\": \"https:\/\/schema.org\",\n  \"@type\": \"FAQPage\",\n  \"mainEntity\": [\n    {\n      \"@type\": \"Question\",\n      \"name\": \"What Is CBD?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"HEMP and CANNABIS both come from the same plant Cannabis Sativa L. Before we get into what CBD is, it’s important for you to understand the plant we are talking about. Specifically, what we call HEMP and what we call CANNABIS. It’s important to note that the CBD molecule from Hemp is the same as the CBD molecule from Cannabis. Many still confuse the fact that these plants are sisters. Hemp contains very low amounts of THC. Many CBD studies have shown an array of medical benefits. The reason CBD and other hemp-derived compounds works well for so many conditions, is the endocannabinoid system, a central component of the health and healing of every human and almost every animal.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"How Does CBD Work?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"CBD works as the switch that turns on the regulatory system in the body called the endocannabinoid system. The endogenous cannabinoid system, or endocannabinoid system (ECS), is a recently discovered system of naturally occurring cannabinoids and cannabinoid receptor sites throughout your entire body. This system in the brain is made up of endocannabinoids and their receptor sites.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Can I Get High Off Of CBD?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"The good news is no, you do not get high with CBD. THC has a different effect than CBD on your body because CBD is not psychoactive. So, you will not experience an altered state from CBD, as you would from THC.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Will CBD Show Up on My Drug Test? Does Your Oil Contain THC?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Our products contain below 0.3% tetrahydrocannabinol (THC) so should not cause a failed drug test as it is below the legal limit. However, it is important to check with your employer about their requirements for THC limits. In addition, CBD does not show up positive on standard drug tests for marijuana.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Is CBD Addictive?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"CBD, or cannabidiol, is generally not considered to be addictive, according to current scientific understanding. The World Health Organization (WHO) has stated that 'CBD exhibits no effects indicative of any abuse or dependence potential.'\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Does CBD Cause An Increase In Appetite?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"THC is typically known to have a profound increase in appetite, but CBD helps regulate your digestive system. Some people, however, might experience a slight increase in appetite but that is due to a metabolism improvement.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Can CBD benefit me if I have Inflammatory Bowel Disease (IBS)?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"There are a number of articles and studies that strongly support the role that Cannabidiol (CBD) plays in the treatment of IBS and even colon cancer.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"What are the CBD Oil Benefits to Childhood Epilepsy?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"There are a number of articles and studies that strongly support the role that Cannabidiol (CBD) plays in the treatment of epilepsy and seizures.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Can CBD help treat or prevent Parkinson's disease?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Recent developments in CBD research states that there is a growing body of evidence through small non-human trials that shows CBD in conjunction with THC that may slow the progress of Parkinson's disease.Click here to view study https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC6682376\/\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Which product is best for cancer?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Firstly, we can not make any claims about our product and cancer or any disease. That being said, studies have shown amazing effects with CBD. We strongly advise working with a professional that intimately understands your unique situation.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"I have a condition and was wondering if it will help me?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Due to FDA regulations, we cannot state any claims regarding our products ability to help with specific ailments or diseases, as our products are considered a nutritional supplement or food. However, CBD is a powerful nutrient that helps the body do what it does best - heal itself.\"\n      }\n\t  },\n {\n      \"@type\": \"Question\",\n      \"name\": \"What is SOL CBD?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"SOL CBD is a U.S.-based company offering a variety of CBD products designed to improve wellness. Our products are CO2 extracted and made from organic, non-GMO hemp.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"How Is Topical CBD Absorbed?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Topical CBD interacts with CB receptors located in the dermis, the second layer of skin. This allows for quick relief but requires generous application due to the skin's low permeability.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"What Percentage Of CBD Is In SOL CBD?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"The percentage of CBD is mostly relevant during the formulation process. What's more important for customers is the overall quality of the oil. SOL CBD oil is CO2 extracted and carefully processed to maintain all key medicinal components of the hemp plant.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"What's The Difference Between Hemp & Cannabis?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Both hemp and cannabis come from the Cannabis Sativa L. plant but are used for different purposes. Hemp is typically used for industrial applications, while cannabis is used for medicinal, recreational, or spiritual purposes. Hemp contains lower levels of THC compared to cannabis.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"I'm Not Feeling Anything After Taking CBD\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"CBD's effects can vary from person to person and may take time to set in. Lifestyle, diet, stress levels, and other factors can influence how you react to CBD. It is a nutrient designed to assist in the process of achieving optimal health, not a magic pill.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Are There Drug Interactions I Should Know About?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"While CBD is generally safe, it may interact with certain medications like blood thinners and anti-epileptic drugs. It's always best to consult your physician, especially if you're taking medication.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Is It Normal To Feel Dizzy When You First Start Taking?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Some people report feeling dizzy when they first start taking our tinctures that contain MCT oil derived from organic coconut oil. This usually subsides within a week and taking the tincture with food can help.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Is It Normal To Feel Tired After Starting The Products?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Yes, feeling tired can occur as your body is adjusting. It's a good idea to listen to your body and adjust your dosage as needed.\"\n      }\n    }\n  ]\n}\n\n<\/script>","column_width":12,"column_width_mobile":12,"text_alignment":"text-center"}}},"block_order":["template--19811370795287__adb4e673-02fd-41cc-a905-b5725680ce40-html-1"],"settings":{"show_on_desktop":true,"show_on_mobile":true,"padding_section":true,"section_style":"section-blank","wrapper_size":""}}},"order":["main","adb4e673-02fd-41cc-a905-b5725680ce40"]}